DataProcessors/ИнтеграцияССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ИнтеграцияССайтом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиДоступаКСайту</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьПараметрыДоступа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыОбменаССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыОбменаССайтом</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Напрямую</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧерезФайловыйРесурс</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НастройкиДоступаКСайту.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>НастройкиДоступаКСайту</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбменаССайтом</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХранитьПароль</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайловыйРесурс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидШаблонаСайта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыСайта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/ИнтеграцияССайтом/Forms/ЛицевыеСчета/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
// Обработка события "ПриСозданииНаСервере" формы.
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекОбъект = ДанныеФормыВЗначение(Объект, Тип("ОбработкаОбъект.ИнтеграцияССайтом"));
	
	ТекОбъект.ИнициализацияРеквизитов();
	
	ЗначениеВДанныеФормы(ТекОбъект, Объект);
	
	Если НЕ Объект.НастройкаДоступа = Справочники.НастройкиДоступаКСайту.ПустаяСсылка() Тогда
		ЗаполнитьПараметрыПодключения();
		ПервоеОткрытие = УстановитьФактПервогоОткрытия(Объект.НастройкаДоступа);
	Иначе
		ПервоеОткрытие = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
// Обработка события "ПриОткрытии" формы.
//
Процедура ПриОткрытии(Отказ)
	
	Если ПервоеОткрытие Тогда
		ОбработкаПервогоОткрытияФормы();
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // ПриОткрытии()

&НаКлиенте
// Обработка события "Оповещение" формы.
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если НЕ ИмяСобытия = "ПередачаТЗ" И НЕ ИмяСобытия = "ПередачаВыбранныхЛС" Тогда
		Возврат;
	КонецЕсли;
	
	АдресВХранилище = Параметр;
	МассивЛС        = ПолучитьИзВременногоХранилища(АдресВХранилище);
	
	ЗаполнитьТаблицуЛицевыхСчетов(МассивЛС);
	
	УправлениеФормой();
	
КонецПроцедуры // ОбработкаОповещения()

&НаКлиенте
// Обработка события "ПередЗакрытием" формы.
//
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	Если ТаблицаЛС.Количество() > 0 И НЕ ВсеПараметрыЗаписаны Тогда
		ТекстВопроса = НСтр("ru='Имеются несохраненные данные. При закрытии они будут утеряны. Продолжить?';uk='Є незбережені дані. При закритті вони будуть втрачені. Продовжити?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	СохранитьРеквизиты();
	
КонецПроцедуры // ПередЗакрытием()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода лицевого счета.
//
Процедура ТаблицаЛСЛицевойСчетПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаЛС.ТекущиеДанные;
	
	Если ТаблицаЛС.НайтиСтроки(Новый Структура("ЛицевойСчет", ТекДанные.ЛицевойСчет)).Количество() = 1 Тогда
		ИндексСтроки = ТаблицаЛС.Индекс(ТаблицаЛС.НайтиПоИдентификатору(ТекДанные.ПолучитьИдентификатор()));
		ЗаполнитьТаблицуЛицевыхСчетов(ТекДанные.ЛицевойСчет, Истина, ИндексСтроки);
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Выбранный лицевой счет уже имеется в таблице.';uk='Обраний особовий рахунок вже є в таблиці.'"));
		ТекДанные.ЛицевойСчет = ПредопределенноеЗначение("Справочник.ЛицевыеСчета.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры // ТаблицаЛСЛицевойСчетПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПередУдалением" табличной части "ТаблицаЛС".
//
Процедура ТаблицаЛСПередУдалением(Элемент, Отказ)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // ТаблицаЛСПередУдалением()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломИзменения" табличной части "ТаблицаЛС".
//
Процедура ТаблицаЛСПередНачаломИзменения(Элемент, Отказ)
		
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // ТаблицаЛСПередНачаломИзменения()

&НаКлиенте
// Процедура - обработчик события "ПередНачаломДобавления" табличной части "ТаблицаЛС".
//
Процедура ТаблицаЛСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Отказ = Истина;
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // ТаблицаЛСПередНачаломДобавления()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" поля ввода настройки доступа.
//
Процедура НастройкаДоступаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.НастройкаДоступа) И УстановитьФактПервогоОткрытия(Объект.НастройкаДоступа) Тогда
		ОбработкаПервогоОткрытияФормы();
	КонецЕсли;
	
	ВсеПараметрыСгенерированы = Ложь;
	ВсеПараметрыЗаписаны      = Ложь;
	ВсеПараметрыПереданы      = Ложь;
	ВсеКарточкиРаспечатаны    = Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры // НастройкаДоступаПриИзменении()

&НаКлиенте
// Процедура - обработчик события "ПриИзменении" флага "Обновлять параметры доступа".
//
Процедура ПолеОбновлятьПараметрыПриИзменении(Элемент)
	
	Если Объект.ОбновлятьПараметрыДоступа Тогда
		ТекстВопроса = НСтр("ru='Старые параметры будут заменены. Продолжить редактирование?';uk='Старі параметри будуть замінені. Продовжити редагування?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Объект.ОбновлятьПараметрыДоступа = НЕ Объект.ОбновлятьПараметрыДоступа;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПолеОбновлятьПараметрыПриИзменении()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД

&НаКлиенте
// Процедура - обработчик команды заполнения ТЧ "ТаблицаЛС" вручную.
//
Процедура КомандаЗаполнитьЛСПодбором(Команда)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаЛС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';uk='Таблична частина буде очищена. Продовжити?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		ТаблицаЛС.Очистить();
		
		ВсеПараметрыСгенерированы = Ложь;
	КонецЕсли;
	
	ПараметрыВыбораЗначения = Новый Структура;
	ПараметрыВыбораЗначения.Вставить("МножественныйВыбор",	Истина);

	ФормаПодбора = ПолучитьФорму("Справочник.ЛицевыеСчета.Форма.ФормаВыбораСОтбором", ПараметрыВыбораЗначения, ЭтаФорма);
	
	ФормаПодбора.Открыть();
	
КонецПроцедуры // КомандаЗаполнитьЛСПодбором()

&НаКлиенте
// Процедура - обработчик команды генерации параметров доступа
//.
Процедура СгенерироватьПараметры(Команда)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлятьПД = Ложь;
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("Логин", "");
	МассивПустыхЛогинов = ТаблицаЛС.НайтиСтроки(ПараметрыОтбора);
	Если Не МассивПустыхЛогинов.Количество() = ТаблицаЛС.Количество() И Объект.ОбновлятьПараметрыДоступа Тогда
		
		ТекстВопроса = НСтр("ru='Имеющиеся логины и пароли будут заменены новыми. Продолжить?';uk='Наявні логіни і паролі будуть замінені новими. Продовжити?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Объект.ОбновлятьПараметрыДоступа = Ложь;
			Возврат;
		КонецЕсли;
		ОбновлятьПД = Истина;
	КонецЕсли;
	
	ДопЧисло = 0;
	// Перезаполняем все строки ТЧ.
	Для Каждого СтрокаТЧ Из ТаблицаЛС Цикл
		
		Если Не ЗначениеЗаполнено(СтрокаТЧ.Логин) Тогда
			СтруктураПД = СгенерироватьПараметрыНаСервере(СтрокаТЧ.ЛицевойСчет, ДопЧисло);
		ИначеЕсли ОбновлятьПД Тогда
			СтруктураПД = СгенерироватьПараметрыНаСервере(СтрокаТЧ.ЛицевойСчет, ДопЧисло);
		Иначе
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ.Логин          = СтруктураПД.Логин;
		СтрокаТЧ.Пароль         = ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло, 9, "Цифры");
		СтрокаТЧ.ПДИзменены     = Истина;
		СтрокаТЧ.ДанныеЗаписаны = Ложь;
		
		ДопЧисло = ДопЧисло + 1;
		
	КонецЦикла;
	
	ВсеПараметрыСгенерированы = Истина;
	ВсеПараметрыЗаписаны      = Ложь;
	ВсеПараметрыПереданы      = Ложь;
	ВсеКарточкиРаспечатаны    = Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры // СгенерироватьПараметры()

&НаКлиенте
// Процедура - обработчик команды печати памяток.
//
Процедура КомандаРаспечататьПамяткиДоступа(Команда)
	
	Если ЗначениеЗаполнено(Объект.НастройкаДоступа) Тогда
		ПараметрКоманды = Новый Массив;
		
		Для Каждого СтрокаЛС Из ТаблицаЛС Цикл
			Если НЕ ПустаяСтрока("Логин") И НЕ ПустаяСтрока("Пароль") Тогда
				Структура = Новый Структура;
				Структура.Вставить("ЛицевойСчет", СтрокаЛС.ЛицевойСчет);
				Структура.Вставить("Логин",       СтрокаЛС.Логин);
				Структура.Вставить("Пароль",      СтрокаЛС.Пароль);
				
				ПараметрКоманды.Добавить(Структура);
			КонецЕсли;
		КонецЦикла;
		
		УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.ЛицевыеСчета", "ПамяткаДляДоступаВЛичныйКабинетНаСайте",
															 ПараметрКоманды, Неопределено, Неопределено);
		ОбработатьПечатьПамяток();
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана настройка обмена данными.';uk='Не вибрана настройка обміну даними.'"));
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // КомандаРаспечататьПамяткиДоступа()

&НаКлиенте
// Процедура - обработчик команды заполнения ТЧ "ТаблицаЛС" всеми счетами,
// для которых не указаны параметры доступа.
//
Процедура КомандаЗаполнитьВсемиЛСБезПараметров(Команда)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Возврат;
	КонецЕсли;
	
	Если ТаблицаЛС.Количество() > 0 Тогда
		ТекстВопроса = НСтр("ru='Табличная часть будет очищена. Продолжить?';uk='Таблична частина буде очищена. Продовжити?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		ТаблицаЛС.Очистить();
		
		ВсеПараметрыСгенерированы = Ложь;
	КонецЕсли;
	
	ЗаполнитьТаблицуЛСБезПараметров();
	
	Если ТаблицаЛС.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Параметры доступа имеются у всех лицевых счетов.';uk='Параметри доступу є у всіх особових рахунків.'"));
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // КомандаЗаполнитьВсемиЛСБезПараметров()

&НаКлиенте
// Процедура - обработчик команды передачи параметров доступа на сайт.
//
Процедура ПередатьПараметры(Команда)
	
	Если Не ВсеПараметрыЗаписаны Тогда
		ТекстВопроса = НСтр("ru='Не все данные были записаны. Хотите сохранить их и передать на сайт?';uk='Не всі дані були записані. Хочете зберегти їх і передати на сайт?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Да Тогда
			Возврат;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.НастройкаДоступа) Тогда
			ВсеПараметрыЗаписаны = ВебИнтеграцияОбщегоНазначения.ЗаписатьПараметрыДоступаНаСервере(ТаблицаЛС, 
																								   Объект.ОбновлятьПараметрыДоступа, 
																								   Объект.НастройкаДоступа);
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана настройка доступа.';uk='Не вибрана настройка доступу.'"));
		КонецЕсли;
		
	КонецЕсли;
	
	// Если все параметры записаны, передаем их на сайт.
	Если ВсеПараметрыЗаписаны Тогда
		Если ПаролиСгенерированы() Тогда
			
			ЗаполнитьПараметрыПодключения();
			
			Если ПараметрыПодключения.ХранитьПароль Тогда
				Пароль = ПараметрыПодключения.Пароль;
			Иначе
				Пароль = ПолучитьПарольДоступа();
			КонецЕсли;
			
			КлючВозврата = ВыполнитьВыгрузкуПараметровДоступаНаСервере(Пароль);
			
			Если КлючВозврата <>  Неопределено Тогда
				ФайлВыгрузки = ПолучитьИзВременногоХранилища(КлючВозврата);
				
				ПолучитьФайл(ФайлВыгрузки,"ПараметровДоступаПоЛС.xml",Истина);
			КонецЕсли;	
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо указать пароли для всех лицевых счетов.';uk='Необхідно вказати паролі для всіх особових рахунків.'"));
		КонецЕсли;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Необходимо записать параметры доступа.';uk='Необхідно записати параметри доступу.'"));
	КонецЕсли;
	
	ВсеКарточкиРаспечатаны = Ложь;
	
	УправлениеФормой();
	
КонецПроцедуры // ПередатьПараметры()

&НаКлиенте
// Процедура - обработчик команды записи параметров доступа.
//
Процедура КомандаЗаписатьПараметрыДоступа(Команда)
	
	Если ПроверитьПередачуПараметровНаСайт() Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.НастройкаДоступа) Тогда
		ЗаписатьПараметрыДоступаНаСервере();
		
		ВсеПараметрыПереданы   = Ложь;
		ВсеКарточкиРаспечатаны = Ложь;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Не выбрана настройка доступа.';uk='Не вибрана настройка доступу.'"));
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры // КомандаЗаписатьПараметрыДоступа()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

&НаКлиенте
// Управляет видимостью и доступностью элементов формы.
//
Процедура УправлениеФормой()
	
	Если ВсеКарточкиРаспечатаны Тогда
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Истина;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Ложь;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Истина;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Ложь;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Истина;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Ложь;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Истина;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Ложь;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Истина;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Ложь;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Истина;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Истина;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Истина;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Истина;
		
		Элементы.КнопкаРаспечататьПамятки.КнопкаПоУмолчанию = Ложь;
		
	ИначеЕсли ВсеПараметрыПереданы Тогда
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Истина;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Ложь;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Истина;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Ложь;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Истина;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Ложь;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Истина;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Ложь;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Ложь;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Истина;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Истина;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Истина;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Истина;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Истина;
		
		Элементы.КнопкаРаспечататьПамятки.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ВсеПараметрыЗаписаны Тогда
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Истина;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Ложь;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Истина;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Ложь;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Истина;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Ложь;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Ложь;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Истина;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Ложь;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Ложь;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Истина;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Истина;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Истина;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Ложь;
		
		Элементы.ТаблицаЛСПередатьПараметры.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли ВсеПараметрыСгенерированы Тогда
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Истина;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Ложь;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Истина;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Ложь;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Ложь;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Истина;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Ложь;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Ложь;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Ложь;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Ложь;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Истина;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Истина;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Ложь;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Ложь;
		
		Элементы.ТаблицаЛСКнопкаЗаписать.КнопкаПоУмолчанию = Истина;
		
	ИначеЕсли НЕ ТаблицаЛС.Количество() = 0 Тогда
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Истина;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Ложь;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Ложь;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Истина;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Ложь;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Ложь;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Ложь;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Ложь;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Ложь;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Ложь;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Истина;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Ложь;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Ложь;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Ложь;
		
		Элементы.ТаблицаЛССгенерировать.КнопкаПоУмолчанию = Истина;
		
	Иначе
		Элементы.ДекорацияЗаполнитьВыполнено.Видимость     = Ложь;
		Элементы.ДекорацияЗаполнитьВПроцессе.Видимость     = Истина;
		Элементы.ДекорацияСгенерироватьВыполнено.Видимость = Ложь;
		Элементы.ДекорацияСгенерироватьВПроцессе.Видимость = Ложь;
		Элементы.ДекорацияЛогиныВыполнено.Видимость        = Ложь;
		Элементы.ДекорацияЛогиныВПроцессе.Видимость        = Ложь;
		Элементы.ДекорацияПередачаВыполнено.Видимость      = Ложь;
		Элементы.ДекорацияПередачаВПроцессе.Видимость      = Ложь;
		Элементы.ДекорацияПамяткиВыполнено.Видимость       = Ложь;
		Элементы.ДекорацияПамяткиВПроцессе.Видимость       = Ложь;
		
		Элементы.ТаблицаЛСГруппаЗаполнить.Доступность   = Истина;
		Элементы.ТаблицаЛССгенерировать.Доступность     = Ложь;
		Элементы.ТаблицаЛСКнопкаЗаписать.Доступность    = Ложь;
		Элементы.ТаблицаЛСПередатьПараметры.Доступность = Ложь;
		Элементы.КнопкаРаспечататьПамятки.Доступность   = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры // УправлениеФормой()

&НаСервере
// Производить запись сформированных логинов в БД.
//
Процедура ЗаписатьПараметрыДоступаНаСервере()
	
	ВсеПараметрыЗаписаны = ВебИнтеграцияОбщегоНазначения.ЗаписатьПараметрыДоступаНаСервере(ТаблицаЛС,
																						   Объект.ОбновлятьПараметрыДоступа,
																						   Объект.НастройкаДоступа);
	
КонецПроцедуры // ЗаписатьПараметрыДоступаНаСервере()

&НаСервере
// Сохраняет настройки пользователя в хранилище настроек.
//
Процедура СохранитьРеквизиты()
	
	СтруктураНастроек = Новый Структура;
	
	СтруктураНастроек.Вставить("НастройкаДоступа", Объект.НастройкаДоступа);
	
	ХранилищеОбщихНастроек.Сохранить("Обработка.ИнтеграцияССайтом", , СтруктураНастроек);
	
КонецПроцедуры // СохранитьРеквизиты()

&НаСервере
// Формирует структуру с параметрами подключения к сайту.
//
Процедура ЗаполнитьПараметрыПодключения()
	
	ПараметрыПодключения = Новый Структура;
	
	ПараметрыПодключения.Вставить("Пароль",        Объект.НастройкаДоступа.Пароль);
	ПараметрыПодключения.Вставить("ХранитьПароль", Объект.НастройкаДоступа.ХранитьПароль);
	
КонецПроцедуры // ЗаполнитьПараметрыПодключения()

&НаКлиенте
// Открывает форму для ввода пароля.
Функция ПолучитьПарольДоступа()
	
	Возврат ОткрытьФормуМодально("ОбщаяФорма.ВебИнтеграцияВводПароля");
	
КонецФункции // ПолучитьПарольДоступа()

&НаКлиенте
// Проверяет, для всех ли лицевых счетов указаны пароли.
//
// Возвращаемое значение:
//  Булево
//
Функция ПаролиСгенерированы()
	
	Для Каждого Строка ИЗ ТаблицаЛС Цикл
		Если ПустаяСтрока(Строка.Пароль) Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции // ПаролиСгенерированы()

&НаСервере
// Выполняет выгрузку параметров доступа на сайт.
//
Функция  ВыполнитьВыгрузкуПараметровДоступаНаСервере(Пароль)
	
	// Выгружаем данные только по тем л/с, по которым имеются и логин и пароль.
	ТаблицаЗагрузки = ПолучитьТаблицуЛСДляВыгрузки();
	
	КлючВозврата = ВебИнтеграцияОбщегоНазначения.ВыполнитьВыгрузкуПараметровДоступаПоЛС(Объект.НастройкаДоступа,
																			   ТаблицаЗагрузки,
																			   ВсеПараметрыПереданы,
																			   ,
																			   Пароль,
																			   Объект.ОбновлятьПараметрыДоступа);
	Возврат КлючВозврата;																		   
	
КонецФункции // ВыполнитьВыгрузкуПараметровДоступаНаСервере()

&НаСервере
// Формирует таблицу с л/с, у которых имеются и логин и пароль.
//
// Возвращаемое значение:
//  ТаблицаЗначений
//
Функция ПолучитьТаблицуЛСДляВыгрузки()
	
	ТаблицаЗагрузки = ТаблицаЛС.Выгрузить().СкопироватьКолонки();
	
	Для Каждого Строка ИЗ ТаблицаЛС Цикл
		Если НЕ ПустаяСтрока(Строка.Логин) И НЕ ПустаяСтрока(Строка.Пароль) Тогда
			ЗаполнитьЗначенияСвойств(ТаблицаЗагрузки.Добавить(), Строка);
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаЗагрузки;
	
КонецФункции // ПолучитьТаблицуЛСДляВыгрузки()

&НаСервере
// Процедура производит генерацию ПД на сервере.
//
Функция СгенерироватьПараметрыНаСервере(ЛицевойСчет, ДопЧисло)
	
	СтруктураПД = Новый Структура;
	
	// Генерируем логин, пароль, меняем доп. число.
	ДопЧисло = ДопЧисло + 1;
	
	ТекЛогин = ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло, 3, "ВР");
	ТекЛогин = ТекЛогин + ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло, 3, "Цифры");
	ТекЛогин = ТекЛогин + ОСМДСервер.СгенерироватьИдентификатор(ДопЧисло +1, 3, "ВР");
	
	СтруктураПД.Вставить("Логин", ТекЛогин);
	
	Возврат СтруктураПД;
	
КонецФункции // СгенерироватьПараметрыНаСервере()

&НаКлиенте
// При первом открытии предлагает пользователю загрузить в БД данные об аккаунтах
// лицевых счетов на сайте.
//
Процедура ОбработкаПервогоОткрытияФормы()
	
	ТекстВопроса = НСтр("ru='Данные о личных кабинетах жильцов не обнаружены."
"Загрузить их с сайта?';uk='Дані про особисті кабінетах мешканців не виявлені."
"Завантажити їх з сайту?'");
	
	Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
	Если НЕ Ответ = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ПараметрыПодключения.ХранитьПароль Тогда
		Пароль = ПараметрыПодключения.Пароль;
	Иначе
		Пароль = ПолучитьПарольДоступа();
	КонецЕсли;
	
	СведенияОбОшибке = "";
	Если ОбщегоНазначения.ПолучитьЗначениеРеквизита(Объект.НастройкаДоступа, "ТипОбмена") = ПредопределенноеЗначение("Перечисление.ТипыОбменаССайтом.Напрямую") Тогда
		ВебИнтеграцияОбщегоНазначения.ВыполнитьЗагрузкуСведенияОбАккаунтах(Объект.НастройкаДоступа, Пароль);
	Иначе
		
		// Временная заглушка.
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПервогоОткрытияФормы()

&НаСервере
// Заполняет таблицу формы данными по лицевым счетам.
//
// Параметры:
//  МассивЛС - Массив - массив лицевых счетов, данные по которым надо собрать и вывести.
//  ДобавлениеСтроки - Булево - признак того, что в таблицу будет добавлена только 1 строка
//  ИндексСтроки - Число - индекс строки, в которой необходимо вывести данные по л/с
//
Процедура ЗаполнитьТаблицуЛицевыхСчетов(МассивЛС, ДобавлениеСтроки = Ложь, ИндексСтроки = Неопределено)
	
	ТаблицаДанных = ВебИнтеграцияОбщегоНазначения.ПолучитьДанныеПоЛС(МассивЛС);
	
	Если ТаблицаДанных.Количество() > 0 Тогда
		Если НЕ ДобавлениеСтроки Тогда
			ТаблицаЛС.Загрузить(ТаблицаДанных);
		Иначе
			ЗаполнитьЗначенияСвойств(ТаблицаЛС.Получить(ИндексСтроки), ТаблицаДанных[0]);
		КонецЕсли;
	КонецЕсли;
	
	ВсеПараметрыЗаписаны   = Ложь;
	ВсеПараметрыПереданы   = Ложь;
	ВсеКарточкиРаспечатаны = Ложь;
	
КонецПроцедуры // ЗаполнитьТаблицуЛицевыхСчетов()

&НаСервере
// Функция заполняет таблицу всеми лицевыми счетами, для которых не зафиксированы параметры доступа.
//
Функция ЗаполнитьТаблицуЛСБезПараметров()
	
	ТаблицаДанных = ВебИнтеграцияОбщегоНазначения.ПолучитьЛСНеИмеющиеПараметровДоступа();
	ТаблицаЛС.Загрузить(ТаблицаДанных);
	
КонецФункции // ЗаполнитьТаблицуЛСБезПараметров()

&НаКлиенте
// Процедура заполняет поле "КарточкаРаспечатана" в ТЧ "ТаблицаЛС".
//
Процедура ОбработатьПечатьПамяток()
	
	Если ТаблицаЛС.Количество() > 0 Тогда
		Для Каждого СтрокаЛС ИЗ ТаблицаЛС Цикл
			СтрокаЛС.КарточкаРаспечатана = Истина;
		КонецЦикла;
		ВсеКарточкиРаспечатаны = Истина;
	КонецЕсли;
	
КонецПроцедуры // ОбработатьПечатьПамяток()

&НаСервереБезКонтекста
// Проверяет, генерировались ли уже параметры доступа в разрезе текущей настройки.
//
// Параметры:
//  НастройкаДоступа - СправочникСсылка.НастройкиДоступаКСайту - настройка доступа
//
// Возвращаемое значение:
//  Булево
//
Функция УстановитьФактПервогоОткрытия(НастройкаДоступа)
	
	Возврат ВебИнтеграцияОбщегоНазначения.УстановитьФактПервогоОткрытия(НастройкаДоступа);
	
КонецФункции // УстановитьФактПервогоОткрытия()

&НаКлиенте
// Функция проверяет, переданы ли параметры на сайт.
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьПередачуПараметровНаСайт()
	
	Если ВсеПараметрыПереданы Тогда
		ТекстВопроса = НСтр("ru='Параметры доступа уже переданы на сайт."
"Табличная часть будет очищена."
"Продолжить?';uk='Параметри доступу вже передані на сайт."
"Таблична частина буде очищена."
"Продовжити?'");
		Ответ = Вопрос(ТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да,);
		
		Если Ответ <> КодВозвратаДиалога.Нет Тогда
			
			ТаблицаЛС.Очистить();
			ВсеПараметрыЗаписаны      = Ложь;
			ВсеПараметрыПереданы      = Ложь;
			ВсеКарточкиРаспечатаны    = Ложь;
			ВсеПараметрыСгенерированы = Ложь;
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
		
КонецФункции // ПроверитьПередачуПараметровНаСайт()

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	ЗаполнитьТаблицуЛицевыхСчетов(ВыбранноеЗначение);
	
	УправлениеФормой();
	
КонецПроцедуры
